Revit 2027 API
AnalysisDisplayColoredSurfaceSettings Constructor
 Constructs a default instance of colored surface settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayColoredSurfaceSettings()
Public Sub New
public:
AnalysisDisplayColoredSurfaceSettings()
new : unit -> AnalysisDisplayColoredSurfaceSettings
See Also
Reference
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Overload
Autodesk.Revit.DB.Analysis Namespace